TR0001*----------------------------------------------------------------*
TR0001 LINKAGE SECTION.
TR0001*----------------------------------------------------------------*
TR0001 01  PARM-VALUES.
TR0001     05 PARM-COUNT                 PIC S9(4) COMP.
TR0001     05 PARM-ENV                   PIC X(04).
TR0001*================================================================*
TR0001 PROCEDURE DIVISION USING PARM-VALUES.
TR0001*================================================================*
